Naptick/Naphome_Firmware/samples/korvo_voice_assistant/sdkconfig.defaults
# Naphome Phase 0.9 Firmware Configuration Defaults

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Component config
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# I2C Configuration
CONFIG_I2C_ENABLE_DEBUG_LOG=n

# WiFi Configuration
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAX_LEVEL_VERBOSE=y

# Use Gemini AI instead of OpenAI
CONFIG_KVA_USE_GEMINI=y

# Enable Spotify Connect via cspot
CONFIG_KVA_SPOTIFY_USE_CSPOT=y
CONFIG_KVA_SPOTIFY_DEVICE_NAME="Korvo Naphome"

# AWS IoT Configuration
CONFIG_NAPHOME_AWS_IOT_ENDPOINT="a2w3ko3hrweita-ats.iot.ap-south-1.amazonaws.com"
CONFIG_NAPHOME_AWS_IOT_PORT=8883
CONFIG_NAPHOME_AWS_IOT_KEEPALIVE_SEC=120
CONFIG_NAPHOME_AWS_IOT_CLEAN_SESSION=y
CONFIG_NAPHOME_AWS_IOT_AUTO_RECONNECT=y
CONFIG_NAPHOME_AWS_IOT_FAIL_ON_PLACEHOLDER_CERTS=n
CONFIG_SOMNUS_MQTT_CERT_DISCOVERY=y
CONFIG_SOMNUS_MQTT_CERT_DIR="/spiffs/Cert"

# Flash Configuration
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
